Бухгалтерские_задачи_по_методичке/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.Серии</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бухгалтерские_задачи_по_методичке/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_по_методичке/src/ChartsOfAccounts/Бухгалтерский/Бухгалтерский.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Бухгалтерский</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>1</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>1.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>1.2</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>1.3</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>2</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>2.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>2.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>3</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>ТоварыНаХранении</name>
      <description>Товары на хранении</description>
      <code>6</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_по_методичке/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.Субконто</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Контрагенты</types>
  </type>
  <predefined>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотруднкики</name>
      <description>Сотруднкики</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Бухгалтерские_задачи_по_методичке/src/Documents/ПродажаТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если (Константы.УчетПоСкладам.Получить() = Истина) Тогда
		ОбработкаПроведенияУчетПоСкладам(Отказ, Режим);
	Иначе
		ОбработкаПроведенияНетУчетаПоСкладам(Отказ, Режим);
	КонецЕсли;

	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели;

		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);

		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
		Движение.Организация = Организация;
		Движение.Содержание = "выручка по услугам";

		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведенияНетУчетаПоСкладам(Отказ, Режим)

	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	ПВХ = ПланыВидовХарактеристик.ВидыСубконто;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
		|	МАКСИМУМ(ПродажаТоваровТовары.НомерСтроки) КАК НомерСтроки,
		|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаТоваровТовары.Количество) КАК Количество,
		|	СУММА(ПродажаТоваровТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|ГДЕ
		|	ПродажаТоваровТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТоваровТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура
		|ИЗ
		|	Товары КАК Товары";

	Результат = Запрос.Выполнить();

	Блокировка = Новый БлокировкаДанных();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока (ВыборкаДетальныеЗаписи.Следующий() = Истина) Цикл

		ЭлементБД = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
		ЭлементБД.УстановитьЗначение("Период", Новый Диапазон(, Дата));
		ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.Товары);
		ЭлементБД.УстановитьЗначение("Организация", Организация);
		ЭлементБД.УстановитьЗначение("Подразделение", Подразделение);
		ЭлементБД.УстановитьЗначение(ПВХ.Номенклатура, ВыборкаДетальныеЗаписи.Номенклатура);
		ЭлементБД.Режим = РежимБлокировкиДанных.Исключительный;

	КонецЦикла;

	Блокировка.Заблокировать();

	Движения.Проводки.Записать();

	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПВХ.Номенклатура);

	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("Период", МоментВремени());

	Запрос.Текст = "ВЫБРАТЬ
		|	ПроводкиОстатки.Субконто1 КАК Субконто1,
		|	ПроводкиОстатки.СуммаОстатокДт,
		|	ПроводкиОстатки.КоличествоОстатокДт
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары), &ВидыСубконто,
		|		Субконто1 В
		|		(ВЫБРАТЬ
		|			Товары.Номенклатура
		|		ИЗ
		|			Товары КАК Товары)
		|	И Подразделение = &Подразделение
		|	И Организация = &Организация
		|	) КАК ПроводкиОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.НомерСтроки,
		|	Товары.Номенклатура,
		|	Товары.Количество,
		|	Товары.Сумма,
		|	ЕСТЬNULL(Остатки.СуммаОстатокДт, 0) КАК ОстСум,
		|	ЕСТЬNULL(Остатки.КоличествоОстатокДт, 0) КАК ОстКол
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО Товары.Номенклатура = Остатки.Субконто1";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Движения.Проводки.Записывать = Истина;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Себестоимость = 0;

		Если (ВыборкаДетальныеЗаписи.ОстКол < ВыборкаДетальныеЗаписи.Количество) Тогда

			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не хватает " + ВыборкаДетальныеЗаписи.Номенклатура;
			Сообщение.Поле = "Товары[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1)
				+ "].Количество";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();

		ИначеЕсли (ВыборкаДетальныеЗаписи.ОстКол = ВыборкаДетальныеЗаписи.Количество) Тогда
			Себестоимость = ВыборкаДетальныеЗаписи.ОстСум;
		Иначе
			Себестоимость = ВыборкаДетальныеЗаписи.ОстСум
				/ ВыборкаДетальныеЗаписи.ОстКол * ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;

		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели;

		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Договоры", Договор);

		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Движение.Организация = Организация;
		Движение.Содержание = "выручка по товарам";

		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;

		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Склады", Склад);

		Движение.КоличествоКт = ВыборкаДетальныеЗаписи.Количество;

		Движение.Период = Дата;
		Движение.Сумма = Себестоимость;
		Движение.Организация = Организация;
		Движение.Содержание = "себестоимость";

		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведенияУчетПоСкладам(Отказ, Режим)

	Если (Константы.СуммовойУчетПоСкладам.Получить() = Ложь) Тогда

		ОбработкаПроведенияУчетПоСкладамБезСуммовогоУчета(Режим, Отказ);

		Возврат;

	КонецЕсли;

	//Суммовой учет по складам !!
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	ПВХ = ПланыВидовХарактеристик.ВидыСубконто;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
		|	МАКСИМУМ(ПродажаТоваровТовары.НомерСтроки) КАК НомерСтроки,
		|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаТоваровТовары.Количество) КАК Количество,
		|	СУММА(ПродажаТоваровТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|ГДЕ
		|	ПродажаТоваровТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТоваровТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура
		|ИЗ
		|	Товары КАК Товары";

	Результат = Запрос.Выполнить();

	Блокировка = Новый БлокировкаДанных();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока (ВыборкаДетальныеЗаписи.Следующий() = Истина) Цикл

		ЭлементБД = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
		ЭлементБД.УстановитьЗначение("Период", Новый Диапазон(, Дата));
		ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.Товары);
		ЭлементБД.УстановитьЗначение("Организация", Организация);
		ЭлементБД.УстановитьЗначение("Подразделение", Подразделение);
		ЭлементБД.УстановитьЗначение(ПВХ.Номенклатура, ВыборкаДетальныеЗаписи.Номенклатура);
		ЭлементБД.УстановитьЗначение(ПВХ.Склады, Склад);
		ЭлементБД.Режим = РежимБлокировкиДанных.Исключительный;

	КонецЦикла;

	Блокировка.Заблокировать();

	Движения.Проводки.Записать();

	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПВХ.Номенклатура);
	ВидыСубконто.Добавить(ПВХ.Склады);

	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("Период", МоментВремени());

	Запрос.Текст = "ВЫБРАТЬ
		|	ПроводкиОстатки.Субконто1 КАК Субконто1,
		|	ПроводкиОстатки.СуммаОстатокДт,
		|	ПроводкиОстатки.КоличествоОстатокДт
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары), &ВидыСубконто,
		|		Субконто1 В
		|		(ВЫБРАТЬ
		|			Товары.Номенклатура
		|		ИЗ
		|			Товары КАК Товары)
		|	И Подразделение = &Подразделение
		|	И Организация = &Организация
		|	И Субконто2 = &Склад) КАК ПроводкиОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.НомерСтроки,
		|	Товары.Номенклатура,
		|	Товары.Количество,
		|	Товары.Сумма,
		|	ЕСТЬNULL(Остатки.СуммаОстатокДт, 0) КАК ОстСум,
		|	ЕСТЬNULL(Остатки.КоличествоОстатокДт, 0) КАК ОстКол
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО Товары.Номенклатура = Остатки.Субконто1";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Движения.Проводки.Записывать = Истина;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Себестоимость = 0;

		Если (ВыборкаДетальныеЗаписи.ОстКол < ВыборкаДетальныеЗаписи.Количество) Тогда

			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не хватает " + ВыборкаДетальныеЗаписи.Номенклатура;
			Сообщение.Поле = "Товары[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1)
				+ "].Количество";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();

		ИначеЕсли (ВыборкаДетальныеЗаписи.ОстКол = ВыборкаДетальныеЗаписи.Количество) Тогда
			Себестоимость = ВыборкаДетальныеЗаписи.ОстСум;
		Иначе
			Себестоимость = ВыборкаДетальныеЗаписи.ОстСум
				/ ВыборкаДетальныеЗаписи.ОстКол * ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;

		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели;

		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Договоры", Договор);

		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Движение.Организация = Организация;
		Движение.Содержание = "выручка по товарам";

		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;

		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Склады", Склад);

		Движение.КоличествоКт = ВыборкаДетальныеЗаписи.Количество;

		Движение.Период = Дата;
		Движение.Сумма = Себестоимость;
		Движение.Организация = Организация;
		Движение.Содержание = "себестоимость";

		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведенияУчетПоСкладамБезСуммовогоУчета(Отказ, Режим)

	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	ПВХ = ПланыВидовХарактеристик.ВидыСубконто;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
		|	МАКСИМУМ(ПродажаТоваровТовары.НомерСтроки) КАК НомерСтроки,
		|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаТоваровТовары.Количество) КАК Количество,
		|	СУММА(ПродажаТоваровТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|ГДЕ
		|	ПродажаТоваровТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТоваровТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура
		|ИЗ
		|	Товары КАК Товары";

	Результат = Запрос.Выполнить();

	Блокировка = Новый БлокировкаДанных();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока (ВыборкаДетальныеЗаписи.Следующий() = Истина) Цикл

		ЭлементБД = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
		ЭлементБД.УстановитьЗначение("Период", Новый Диапазон(, Дата));
		ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.Товары);
		ЭлементБД.УстановитьЗначение("Организация", Организация);
		ЭлементБД.УстановитьЗначение("Подразделение", Подразделение);
		ЭлементБД.УстановитьЗначение(ПВХ.Номенклатура, ВыборкаДетальныеЗаписи.Номенклатура);
		//ЭлементБД.УстановитьЗначение(ПВХ.Склады, Склад);
		ЭлементБД.Режим = РежимБлокировкиДанных.Исключительный;

	КонецЦикла;

	Блокировка.Заблокировать();

	Движения.Проводки.Записать();

	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПВХ.Номенклатура);
	ВидыСубконто.Добавить(ПВХ.Склады);

	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("Период", МоментВремени());

	Запрос.Текст = "ВЫБРАТЬ
		|	ПроводкиОстатки.Субконто1 КАК Субконто1,
		|	ПроводкиОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт
		|ПОМЕСТИТЬ ОстаткиСклад
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары),
		|			&ВидыСубконто,
		|			Субконто1 В
		|					(ВЫБРАТЬ
		|						Товары.Номенклатура
		|					ИЗ
		|						Товары КАК Товары)
		|				И Подразделение = &Подразделение
		|				И Организация = &Организация
		|				И Субконто2 = &Склад) КАК ПроводкиОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроводкиОстатки.Субконто1 КАК Субконто1,
		|	ПроводкиОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	ПроводкиОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт
		|ПОМЕСТИТЬ ОстаткиВсе
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары),
		|			&ВидыСубконто,
		|			Субконто1 В
		|					(ВЫБРАТЬ
		|						Товары.Номенклатура
		|					ИЗ
		|						Товары КАК Товары)
		|				И Подразделение = &Подразделение
		|				И Организация = &Организация) КАК ПроводкиОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Количество КАК Количество,
		|	Товары.Сумма КАК Сумма,
		|	ЕСТЬNULL(ОстаткиВсе.СуммаОстатокДт, 0) КАК ОстСум,
		|	ЕСТЬNULL(ОстаткиВсе.КоличествоОстатокДт, 0) КАК ОстКол,
		|	ЕСТЬNULL(ОстаткиСклад.КоличествоОстатокДт, 0) КАК ОстКолСклад
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСклад КАК ОстаткиСклад
		|		ПО Товары.Номенклатура = ОстаткиСклад.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиВсе КАК ОстаткиВсе
		|		ПО Товары.Номенклатура = ОстаткиВсе.Субконто1";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Движения.Проводки.Записывать = Истина;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Себестоимость = 0;

		Если (ВыборкаДетальныеЗаписи.ОстКолСклад < ВыборкаДетальныеЗаписи.Количество) Тогда

			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не хватает " + ВыборкаДетальныеЗаписи.Номенклатура;
			Сообщение.Поле = "Товары[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1)
				+ "].Количество";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();

		ИначеЕсли (ВыборкаДетальныеЗаписи.ОстКол = ВыборкаДетальныеЗаписи.Количество) Тогда
			Себестоимость = ВыборкаДетальныеЗаписи.ОстСум;
		Иначе
			Себестоимость = ВыборкаДетальныеЗаписи.ОстСум
				/ ВыборкаДетальныеЗаписи.ОстКол * ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;

		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели;

		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Договоры", Договор);

		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Движение.Организация = Организация;
		Движение.Содержание = "выручка по товарам";

		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;

		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Склады", Склад);

		Движение.КоличествоКт = ВыборкаДетальныеЗаписи.Количество;

		Движение.Период = Дата;
		Движение.Сумма = Себестоимость;
		Движение.Организация = Организация;
		Движение.Содержание = "себестоимость";

		БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	КонецЦикла;

КонецПроцедуры
